{
  "error.OlderThanServer": "The $(shortName) service requires a newer version of the extension than you have installed.",
  "error.NewerThanServer": "The extension you have installed requires a newer version of the $(shortName) service.",
  "error.OlderThanPeer": "The $(shortName) extension you have installed is too old to connect to this collaboration session.",
  "error.NewerThanPeer": "The collaboration session owner is on an older version of the $(shortName) extension than you are.",
  "error.OlderThanAgent": "The $(shortName) agent is newer than the extension",
  "error.NewerThanAgent": "The $(shortName) agent is older than the extension",
  "error.NoIPAddressesDetected": "Unable to share in \"Direct\" mode as there are no suitable IP addresses. Switch to \"Auto\" or \"Relay\" mode and retry.",
  "error.NoConnectionAddresses": "Could not find a compatible connection address. Switch to \"Auto\" mode and retry.",
  "error.AutoConnectionFailed": "Unable to connect to the host. Verify both you and the host are online.",
  "error.RelayConnectionFailed": "Unable to connect to the host in \"Relay\" mode. Verify you and the host are online. If so, switch to \"Auto\" or \"Direct\" mode and retry.",
  "error.DirectConnectionFailed": "Unable to connect to the host in \"Direct\" mode. Verify you and the host are online. If so, switch to \"Auto\" or \"Relay\" mode and retry.",
  "error.SessionProtocolError": "Unable to join the host due to a protocol error. Verify you and the host are online and are using the latest version of $(shortName).",
  "error.SessionAuthenticationFailed": "Unable to join the host due to an authentication error. Verify the host is online, then sign out and sign in again and retry.",
  "error.DirectConnectionNotEnabled": "The host does not allow direct connections. Switch to \"Auto\" or \"Relay\" mode and retry.",
  "error.RelayConnectionNotEnabled": "Unable to connect since the host does not allow relayed connections. Switch to \"Auto\" or \"Direct\" mode and retry.",
  "error.CollaborationSessionUsersLimitReached": "Could not join the collaboration session as it has already reached the maximum of 5 participants.",
  "error.BlockActionDirectModePrompt":"Unable to share. Visual Studio Live Share is currently in the \"Direct\" connection mode and your firewall has blocked incoming secured connections required to start a collaboration session.\n\nIn order to share, you will need to modify your firewall rules to allow vsls-agent.exe to accept incoming connections or switch to the \"Auto\" or \"Relay\" connection mode.",
  "error.BlockActionShareFailed":"Failed to create a collaboration session due to firewall settings.",
  "error.CollaborationSessionGuestRejected": "The host rejected your request to join the collaboration session.",
  "error.CollaborationSessionRequestTimedOut": "Timed out while waiting for the host to respond to your request.",
  "error.CollaborationSessionGuestCanceled": "Request to join the collaboration session was canceled.",
  "error.CollaborationSessionNotFound": "Collaboration session not found.",
  "error.KeychainAccessFailed": "Live Share was unable to access the login keychain. This can happen if you recently changed your password or your login keychain has become corrupted. See more info for details on how to fix it.",
  "warning.BlockActionAutoModePrompt":"Your firewall is blocking vsls-agent.exe from accepting direct connections on ports Visual Studio Live Share requires to improve performance for collaborators on the same network.\n\nLive Share will now switch to the \"Relay\" connection mode for all future sessions and route traffic through a cloud relay. Press \"Cancel\" to stop sharing instead.",
  "info.NoneActionAutoModePrompt":"Visual Studio Live Share is currently in the \"Auto\" connection mode that improves performance for collaborators on the same network by accepting incoming secured connections when sharing.\n\nYour firewall will now prompt you to give vsls-agent.exe access to the required ports. Denying this access will route all connections through a cloud relay instead.",
  "info.NoneActionDirectModePrompt":"Visual Studio Live Share is currently in the \"Direct\" connection mode and must accept incoming secured connections when sharing in order to function.\n\nYour firewall will now prompt you to give vsls-agent.exe access to the required ports. If you deny access, you will be unable to share.",
	"progress.openingRemoteSession": "Opening remote session...",
	"progress.joiningRemoteSession": "Joining remote session...",
	"progress.waitingForHost": "Waiting for host approval..."
}
